PANDAS

In [4]:
import pandas as pd

Series

In [7]:
mydata1=["Nanditha","vinayaka","hema","varshini","Navya"]
Ser1=pd.Series(mydata1)
print(Ser1)

0    Nanditha
1    vinayaka
2        hema
3    varshini
4       Navya
dtype: object

In [9]:
Ser1[4]

'Navya'

In [11]:
Ser1[1]

'vinayaka'

In [15]:
mydata1=["Megha","Nanditha","hema","vinay","sahana"]
roll=['A','B','C','D','E']
Ser1=pd.Series(mydata1)
print(Ser1)

0       Megha
1    Nanditha
2        hema
3       vinay
4      sahana
dtype: object

In [17]:
mydata1=["Megha","Nanditha","hema","vinay","sahana"]
roll=[2,23,12,8,9]
Ser1=pd.Series(mydata1)
print(Ser1)

0       Megha
1    Nanditha
2        hema
3       vinay
4      sahana
dtype: object

In [25]:
Ser1.to_csv(r"C:\Users\DELL\Desktop\mypythonfiles\mydata1.csv")

DATAFRAMES

In [28]:
mydict ={"Names":["Megha","Nandu","Hema","vinay"],
         "Age":[19,19,19,26],
         "city":["haveri","Gangavathi","Gangavati","sandur"]
        }
print(mydict)

{'Names': ['Megha', 'Nandu', 'Hema', 'vinay'], 'Age': [19, 19, 19, 26], 'city': ['haveri', 'Gangavathi', 'Gangavati', 'sandur']}

In [30]:
dict_df=pd.DataFrame(mydict)
print(dict_df)

   Names  Age        city
0  Megha   19      haveri
1  Nandu   19  Gangavathi
2   Hema   19   Gangavati
3  vinay   26      sandur

In [32]:
dict_df.to_csv(r"C:\Users\DELL\Desktop\mypythonfiles\dictdata.csv")

LOAD DATA

In [35]:
df1=pd.read_csv(r"C:\Users\DELL\Downloads\python1.csv")

In [37]:
df1.head()

         Name Dept  Sem1  Sem2  Sem3
0    Nanditha  Ise   8.1   8.1   9.0
1       Megha  Ise   8.5   8.8   8.6
2        Hema  Ise   7.9   8.3   8.8
3    Varshini  Ise   9.0   9.2   9.3
4  Navyashree  Ise   8.7   9.0   9.0

LARGE DATA

In [40]:
diab_df=pd.read_csv(r"C:\Users\DELL\Desktop\mypythonfiles\diabetcsvsmall.csv")
diab_df.head()

   preg  plas  pres  skin  insu  mass   pedi  age            class
0   6.0   148  72.0  35.0     0  33.6  0.627   50  tested_positive
1   1.0    85  66.0  29.0     0  26.6  0.351   31  tested_negative
2   8.0   183  64.0   0.0     0  23.3  0.672   32  tested_positive
3   1.0    89  66.0  23.0    94  28.1  0.167   21  tested_negative
4   0.0   137  40.0  35.0   168  43.1  2.288   33  tested_positive